Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AdjustCurveTooShort Property
 AdjustCurve is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdjustCurveTooShort { get; }
Public Shared ReadOnly Property AdjustCurveTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdjustCurveTooShort {
	FailureDefinitionId^ get ();
}
static member AdjustCurveTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace